%2022.06.07  任斌
%%%%各物理量默认为公制单位

earth_r = 6.371e6; %地球平均半径 单位m
m = 63504; %飞行器质量 单位kg
g0 = 9.806; %重力加速度 单位m/s^2
b = 18.288; %翼展 单位m
c_A = 24.384; %平均气动弦长 单位m
c = 24.384; %纵向参考长度 单位m
S = 334.73; %机翼参考面积 单位m^2
I_xx = 5.4232e5; 
I_yy = 3.6155e6;
I_zz = 3.6155e6; %转动惯量 单位kg*m^2
x_cg = 4.45; %单位m
w_e = 7.292116e-5; %地球自转角速度 单位rad/s
% 不考虑惯性积I_xz

xishu_L_0 = 0.2;
xishu_D_0 = 0.3;
xishu_Y_0 = 0.14;
xishu_l_0 = 0.23;
xishu_m_0 = 0.17;
xishu_n_0 = 0.09;%气动系数摄动系数
xishu = 0;
T = 0;


%TD参数
r_1=0.04;
r_3=0.03;
h_1=0.02;
r_alpha = r_1;
r_beta = r_1;
r_miu = r_3;
h_alpha = h_1;
h_beta = h_1;
h_miu = h_1;

r_2=1.28;
r_p = r_2;
r_q = r_2;
r_r = r_2; 
h_p = h_1;
h_q = h_1;
h_r = h_1;
